{
  "de": {
    "accessabilityTitel": "Barrierefreiheit",
    "accessabilityLabel1": "Mode",
    "accessabilityLabel2": "Schriftgröße",

    "projectCardTitle": "Projektname",
    "projectCardText": "Beschreibung",

    "ctaButton1": "Mehr erfahren",
    "ctaButton2": "Kontakt",

    "privacyLink": "Datenschutz",
    "imprintLink": "Impressum",
    "copyrightText": "© 2025 Rika. Alle Rechte vorbehalten.",

    "aboutNavLink": "ÜBER MICH",
    "projectsNavLink": "PROJEKTE",
    "contactNavLink": "KONTAKT",

    "heroTitle": "UX-Design, das verbindet – Ästhetik, Struktur und echte Nutzerzentrierung",
    "heroText": "Ich kombiniere kreative Leidenschaft mit einem klaren Fokus auf Nutzerbedürfnisse. Gemeinsam gestalten wir digitale Produkte, die nicht nur gut aussehen, sondern sich richtig gut anfühlen – intuitiv, nachhaltig und auf dein Ziel abgestimmt.",
    "projectsTitle": "Einblick ins aktuelle Projekt",
    "contactCta": "Lass uns sprechen!",
    "contactText": "Du hast eine Idee, ein Projekt oder brauchst einfach UX-Unterstützung? Schreib mir – ich freue mich auf ein unverbindliches Kennenlerngespräch.",

    "aboutTitle": "Über mich",
    "aboutText": "Ich bin angehende UX-Designerin mit einem Gespür für nutzerzentrierte Lösungen und einem klaren Blick für Details. Mein Ziel: digitale Erlebnisse zu gestalten, die intuitiv, sinnvoll und einfach angenehm sind.",
    "faqTitle": "FAQs",
    "faqIntro": "Was du über UX-Design und meine Arbeitsweise wissen solltest – hier findest du die wichtigsten Antworten auf einen Blick.",
    "faqQuestion1": "Was ist UX-Design und warum interessiert es dich?",
    "faqAnswer1": "UX-Design bedeutet, digitale Produkte zu gestalten, die sich intuitiv nutzen lassen und echten Mehrwert bieten. Mich begeistert daran besonders, wie durchdachtes Design das Leben einfacher machen kann. Als Quereinsteigerin bringe ich frische Perspektiven und einen unvoreingenommenen Blick mit – das hilft, echte Nutzerbedürfnisse zu erkennen und kreative Lösungen zu entwickeln.",
    "faqQuestion2": "Warum hast du dich für den Quereinstieg entschieden?",
    "faqAnswer2": "Ich habe mich bewusst für den Quereinstieg entschieden, weil ich meine Leidenschaft für Design und Technik mit meinem strategischen Denken verbinden wollte. In meinem bisherigen Werdegang habe ich gelernt, komplexe Probleme strukturiert zu analysieren – jetzt setze ich das im UX-Design kreativ um.",
    "faqQuestion3": "Was sind deine Schwerpunkte im UX-Design?",
    "faqAnswer3": "Mich reizt besonders der Bereich, wo UX-Design auf gesellschaftliche Herausforderungen trifft. Ich arbeite am liebsten an Konzepten, die inklusiv gedacht sind, echten Mehrwert schaffen und sich an den Bedürfnissen echter Menschen orientieren – nicht an Buzzwords.<br>Mein Fokus liegt dabei auf der Nutzerforschung und dem Interaktionsdesign. Ich will verstehen, <b>was Menschen wirklich brauchen</b>, bevor ich gestalte. Ich spreche mit Nutzer:innen, analysiere ihr Verhalten und entwickle Lösungen, die nicht nur funktionieren, sondern sich richtig anfühlen.<br>UX bedeutet für mich nicht nur schöne Interfaces, sondern <b>Verantwortung mit Design.</b>",
    "faqQuestion4": "Welche Projekte hast du bisher gemacht?",
    "faqAnswer4": "Aktuell stecke ich in der Planungsphase von drei Projekten, die mir besonders am Herzen liegen:",
    "faqProject1": "<b>MamAid</b> – eine Community-Plattform für Mütter, vor allem für Erstlingsmütter oder Frauen ohne starkes soziales Netz. Der Fokus liegt auf Austausch, Unterstützung und einem Gefühl von „Ich bin nicht allein“.",
    "faqProject2": "<b>IncluCook</b> – eine Website, die Rezepte für Menschen mit körperlichen oder psychischen Einschränkungen zugänglich macht. Von intuitiver Navigation bis zu leicht verständlichen Rezeptschritten: Barrierefreiheit ist hier das Kernkonzept.",
    "faqProject3": "(Arbeitstitel) – eine App, die Lehrkräften hilft, digitale Medienkompetenz in den Unterricht zu integrieren – und gleichzeitig Grundschulkinder individuell unterstützt, besonders bei Themen wie Konzentration oder Lesefähigkeit.",
    "faqAnswer4End": "Auch wenn noch nichts davon live ist, zeigen diese Projekte, woran ich glaube: Design kann gesellschaftlich relevant sein – und genau da will ich hin.",
    "faqQuestion5": "Wie gehst du bei einem Designprozess vor?",
    "faqAnswer5": "Ich arbeite strukturiert, empathisch und iterativ. Jedes Projekt startet bei mir mit einem Notion-Board – dort sammle ich alles: von Research bis Testing. Ich führe Gespräche mit echten Nutzer:innen, bevor ich eine einzige Wireframe zeichne. Nur so kann ich wirklich verstehen, was gebraucht wird.<br> Darauf folgt ein agiler Prozess aus Ideen, Prototyping und kontinuierlichem Feedback. Mir ist wichtig, dass die Zielgruppe nicht nur am Anfang mitgedacht, sondern durchgehend eingebunden wird – vom ersten Interview bis zum finalen Testing. <br><b>UX ohne echte Nutzer:innen ist für mich nur Deko.</b>",
    "faqQuestion6": "Was macht UX-Design für dich so besonders?",
    "faqAnswer6": "UX-Design ist für mich mehr als Gestaltung – es ist die Brücke zwischen echten Problemen und möglichen Lösungen.<br>Ich liebe es, wenn ich kreative Ideen mit logischem Denken verbinden kann. UX erlaubt mir, meine Stärken voll auszuspielen: zuhören, analysieren, visualisieren – und am Ende entsteht etwas, das Menschen wirklich hilft. Es ist einfach das perfekte Zusammenspiel aus <b>Kreativität, Struktur und Empathie.</b>",

    "projectsHeader": "Meine Projekte – coming soon",
    "projectsText": "Gutes UX braucht Zeit. Ich arbeite derzeit an drei Herzensprojekten rund um Inklusion, Elternschaft und digitale Bildung. Bald kannst du hier mehr darüber erfahren – mit echten Einblicken in meinen Designprozess.",

    "contactTitle": "Lass uns sprechen!",
    "contactHeroText": "Ob Projektidee, spontaner Austausch oder ein erstes Kennenlernen – ich freue mich, von dir zu hören. Schreib mir einfach und wir finden heraus, ob wir zusammen an deiner Vision arbeiten wollen.",
    "formName": "Name:",
    "formEmail": "E-Mail:",
    "formMessage": "Nachricht:",
    "formSubmit": "Senden",
    "formSuccess": "✓ Nachricht gesendet! Ich melde mich bald.",

    "imprintTitle1": "Impressum",
    "imprintContent1": "Angaben gemäß § 5 TMG:<br>Rika Federov<br>Wettersteinstraße 56<br>90471 Nürnberg",
    "imprintContent2": "<b>Verantworlich für den Inhalt nach § 55 Abs. 2 RStV</b>:<br> Rika Federov",
    "imprintTitle2": "Steitschlichtung",
    "imprintContent3": "Die Europäische Kommission stellt eine <a href='https://ec.europa.eu/consumers/odr/' target='_blank' rel='noopener noreferrer'>Plattform zur Online-Streitbeilegung (OS)</a> bereit:<br>Ich bin nicht verpflichtet und nicht bereit, an Streitbeilegungsverfahren vor einer Verbraucherschlichtungsstelle teilzunehmen.",

    "privacyTitle": "Datenschutzerklärung",
    "privacySubtitle1": "Auf einen Blick",
    "privacyContent1": "<b>Der Schutz Ihrer persönlichen Daten ist mir sehr wichtig.</b><br>Ich nehme den Schutz Ihrer Privatsphäre ernst und behandle Ihre personenbezogenen Daten vertraulich und gemäß den gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung. Diese Seite erklärt Ihnen einfach und transparent, welche Daten ich erhebe, wie ich sie verwende und welche Rechte Sie in Bezug auf Ihre Daten haben.",
    "privacySubtitle2": "Verantwortliche Stelle",
    "privacyContent2": "Verantwortlich für die Datenverarbeitung auf dieser Website ist:<br>Rika Federov<br>Wettersteinstraße 56<br>90471 Nürnberg<br>E-Mail: <a href=mailto:'rikafederov@gmail.com' target='_blank' rel='noopener noreferrer'>rikafederov@gmail.com</a>",
    "privacySubtitle3": "Datenerfassung auf dieser Website",
    "privacySubtitle4": "Kontaktformular",
    "privacyContent3": "Wenn Sie mir über das Kontaktformular eine Nachricht senden, werden Ihre Angaben (Name, E-Mail-Adresse, Nachricht) gespeichert, um Ihre Anfrage zu bearbeiten und für mögliche Anschlussfragen. Diese Daten werden ohne Ihre ausdrückliche Zustimmung nicht weitergegeben.<br><b>Hinweis</b>: Die Übertragung Ihrer Daten erfolgt verschlüsselt (SSL/TLS).",
    "privacySubtitle5": "Verwendung von Google Fonts",
    "privacyContent4": "Auf dieser Website werden Schriftarten von Google Fonts verwendet. Um den Schutz Ihrer Daten bestmöglich sicherzustellen, werden die benötigten Schriftarten lokal auf meinem Server gespeichert. Dadurch findet keine Übertragung von IP-Adressen an Google-Server statt.",
    "privacySubtitle6": "Ihre Rechte",
    "privacyContent5": "Sie haben jederzeit das Recht:",
    "privacyAspect1": "Auskunft über Ihre gespeicherten Daten zu erhalten,",
    "privacyAspect2": "eine Berichtigung oder Löschung Ihrer Daten zu verlangen,",
    "privacyAspect3": "die Verarbeitung Ihrer Daten einzuschränken oder der Verarbeitung zu widersprechen,",
    "privacyAspect4": "sich bei einer Aufsichtsbehörde zu beschweren, wenn Sie der Meinung sind, dass die Verarbeitung Ihrer personenbezogenen Daten nicht rechtmäßig erfolgt.",
    "privacyContent5End": "Bei Fragen rund um das Thema Datenschutz können Sie sich jederzeit direkt an mich wenden: <a href=mailto:'rikafederov@gmail.com' target='_blank' rel='noopener noreferrer'>rikafederov@gmail.com</a>"
  },

  "en": {
    "accessabilityTitel": "accessability",
    "accessabilityLabel1": "mode",
    "accessabilityLabel2": "fontsize",

    "projectCardTitle": "project name",
    "projectCardText": "short description of the project.",

    "ctaButton1": "learn more",
    "ctaButton2": "contact",

    "privacyLink": "Privacy Policy",
    "imprintLink": "Imprint",
    "copyrightText": "© 2025 Rika. All rights reserved.",

    "aboutNavLink": "ABOUT ME",
    "projectsNavLink": "PROJECTS",
    "contactNavLink": "CONTACT",

    "heroTitle": "UX design that connects - aesthetics, structure and a real focus on the user",
    "heroText": "I combine creative passion with a clear focus on user needs. Our collaborative process ensures the delivery of digital products that are not merely aesthetically pleasing, but ergonomically sound. Our solutions are meticulously designed to be intuitive, sustainable, and customised to align with your organisational objectives.",
    "projectsTitle": "Current project preview",
    "contactCta": "Let's talk!",
    "contactText": "Have an idea, project, or need UX support? Reach out – I'd love to chat for a no-strings-attached consultation.",

    "aboutTitle": "About me",
    "aboutText": "I'm an aspiring UX designer with a knack for user-centered solutions and a sharp eye for detail. My aim is to create digital experiences that are intuitive, meaningful, and simply enjoyable.",
    "faqTitle": "FAQs",
    "faqIntro": "What you should know about UX design and my approach – here are the key answers at a glance.",
    "faqQuestion1": "What is UX design and why are you so interested in it?",
    "faqAnswer1": "UX design is about creating digital products that are intuitive to use and deliver real value. What excites me most is how thoughtful design can make life easier. As someone who has changed careers, I bring fresh perspectives and an unbiased approach – helping to identify genuine user needs and develop creative solutions.",
    "faqQuestion2": "Why did you choose to switch careers?",
    "faqAnswer2": "I chose to pivot into UX design to combine my passion for design and technology with my strategic thinking. My background taught me to analyze complex problems methodically – now I apply that creatively in UX design.",
    "faqQuestion3": "What are your focus areas in UX?",
    "faqAnswer3": "I'm particularly drawn to where UX meets societal challenges. I love working on <b>inclusive concepts that create true value and address actual human needs.</b>",
    "faqQuestion4": "What projects have you worked on so far?",
    "faqAnswer4": "I am currently in the planning phase of three projects that are particularly close to my heart:",
    "faqProject1": "<b>MamAid</b> - a community platform for mothers, especially first-time mothers or women without strong support. The focus is on exchange, encouragement and a sense of ‘I'm not alone’.",
    "faqProject2": "<b>IncluCook</b> - a website that makes recipes accessible for people with physical or mental disabilities. From intuitive navigation to easy-to-understand recipe steps: Accessibility is the core concept here.",
    "faqProject3": "(working title) - an app that helps teachers to integrate digital media competence into the classroom - and at the same time supports elementary school children individually, especially with topics such as concentration or reading skills.",
    "faqAnswer4End": "Even though none of them are live yet, these projects show what I believe in: design can be socially relevant - and that's where I want to go.",
    "faqQuestion5": "How do you approach a design process?",
    "faqAnswer5": "I work in a structured, empathetic and iterative way. I start every project with a notion board - where I collect everything from research to testing. <b>I talk to real users</b> before I draw a single wireframe. This is the only way I can really understand what is needed. This is followed by an agile process of ideation, prototyping and continuous feedback. It's important to me that the target group is not only considered at the beginning, but is involved throughout - from the first interview to the final test. <b>For me, UX without real users is just decoration.</b>",
    "faqQuestion6": "What is it that makes UX design so special to you?",
    "faqAnswer6": "For me, UX design is more than just design - it is the bridge between real problems and possible solutions. I love combining creative ideas with logical thinking. UX allows me to play to my strengths: listening, analysing, visualising - and the end result is something that really helps people. It's the perfect combination of <b>creativity, structure and empathy</b>",

    "projectsHeader": "My projects – coming soon",
    "projectsText": "Great UX takes time. I'm currently working on three passion projects around inclusion, parenthood, and digital education. Stay tuned for behind-the-scenes insights into my design process.",

    "contactTitle": "Let's connect!",
    "contactHeroText": "Whether it's a project idea, quick chat, or first meeting – I'd love to hear from you. Drop me a message, and we'll explore how we can bring your vision to life.",
    "formName": "Name:",
    "formEmail": "Email:",
    "formMessage": "Message:",
    "formSubmit": "Send",
    "formSuccess": "✓ Message sent! I'll get back to you soon.",

    "imprintTitle1": "Imprint",
    "imprintContent1": "Details according to § 5 German Telemedia Act:<br>Rika Federov<br>Wettersteinstraße 56<br>90471 Nürnberg",
    "imprintContent2": "<b>Responsible for the content according to § 55 Abs. 2 RStV</b>:<br> Rika Federov",
    "imprintTitle2": "Arbitration",
    "imprintContent3": "The European Commission provides a <a href='https://ec.europa.eu/consumers/odr/' target='_blank' rel='noopener noreferrer'>platform for online dispute resolution (ODR)</a>:<br>I am neither obliged nor willing to participate in dispute resolution proceedings before a consumer arbitration board.",

    "privacyTitle": "Privacy policy",
    "privacySubtitle1": "At a glance",
    "privacyContent1": "<b>The protection of your personal data is very important to me. </b><br> take the protection of your privacy seriously and treat your personal data confidentially and in accordance with the statutory data protection regulations and this privacy policy. This page explains simply and transparently what data I collect, how I use it and what rights you have in relation to your data.",
    "privacySubtitle2": "Responsible body",
    "privacyContent2": "Responsible for data processing on this website is:<br>Rika Federov<br>Wettersteinstraße 56<br>90471 Nürnberg<br>E-mail: <a href=mailto:'rikafederov@gmail.com' target='_blank' rel='noopener noreferrer'>rikafederov@gmail.com</a>",
    "privacySubtitle3": "Data collection on this website",
    "privacySubtitle4": "contact form",
    "privacyContent3": "If you send me a message via the contact form, your details (name, e-mail address, message) will be stored in order to process your enquiry and for possible follow-up questions. This data will not be passed on without your express consent.<br><b>Note</b>: The transmission of your data is encrypted (SSL/TLS).",
    "privacySubtitle5": "Use of Google Fonts",
    "privacyContent4": "Fonts from Google Fonts are used on this website. To ensure the best possible protection of your data, the required fonts are stored locally on my server. This means that IP addresses are not transmitted to Google servers.",
    "privacySubtitle6": "Your rights",
    "privacyContent5": "You have the right at all times:",
    "privacyAspect1": "to receive information about your stored data,",
    "privacyAspect2": "to request a correction or deletion of your data,,",
    "privacyAspect3": "to restrict the processing of your data or to object to the processing,",
    "privacyAspect4": "to file a complaint with a supervisory authority if you are of the opinion that the processing of your personal data is not lawful.",
    "privacyContent5End": "If you have any questions about data protection, you can contact me directly at any time: <a href=mailto:'rikafederov@gmail.com' target='_blank' rel='noopener noreferrer'>rikafederov@gmail.com</a>"
  }
}
